[
  {
    "person_id": 2,
    "extracted_memories": [
      {
        "Id": "20760",
        "Description": "This is the user, the person that is talking to you",
        "Profile": {
          "job": ["High school counselor"],
          "health": [
            "Feeling overwhelmed due to work and family commitments",
            "Has type 2 diabetes"
          ],
          "notes": [
            "Finding it hard to find time for self, seeking advice on work-life balance",
            "Hasn't had time for yoga lately but wants to fit it into schedule again",
            "Plans to wake up earlier to fit in a short yoga session in the mornings before others are up",
            "Plans to do yoga with her daughter Emma when she is home",
            "Practices yoga often",
            "Still learning yoga",
            "Considering attending a beginner's yoga class with her son Jake",
            "Plans to ask friends from her book club for yoga class recommendations",
            "Hopes to spend quality time with Jake through yoga",
            "Plans to create watercolor paintings with her mother to send to seniors or hospitals",
            "Feels reassured to find ways to balance work, family, and personal interests by combining relaxation and volunteering.",
            "Plans to dedicate Wednesday evenings after work to painting watercolors with her mother to send to local hospitals or senior centers.",
            "Plans to work with her son Jake on Saturdays to package and deliver paintings to local hospitals or senior centers.",
            "Plans to involve David in family painting sessions to strengthen family bonds."
          ],
          "interests": [
            "Used to do yoga often",
            "Member of a book club",
            "Volunteers at the food bank",
            "Interested in finding at-home volunteer activities to do with her mother despite her mobility issues.",
            "Often paints watercolors with her mother at home"
          ],
          "age": ["50 years old"],
          "location": ["Lives in Seattle"],
          "name": ["Patricia"]
        },
        "Connections": [
          {
            "id": "93906",
            "relationship": "This is my husband"
          },
          {
            "id": "79125",
            "relationship": "This is my mother"
          },
          {
            "id": "15044",
            "relationship": "this is my daughter"
          },
          {
            "id": "41703",
            "relationship": "This is my 17-year-old son Jake"
          }
        ]
      },
      {
        "Id": "93906",
        "Description": "My husband who works at the hospital and leaves early for work",
        "Profile": {
          "job": ["Works at the hospital and leaves early for work"],
          "notes": [
            "He is very close with his son Jake and they often have their own plans on weekends.",
            "Married to the user for 23 years",
            "Has always been supportive of Patricia's hobbies.",
            "Expressed interest in seeing what the family creates together."
          ],
          "name": ["David"]
        },
        "Connections": [
          {
            "id": "20760",
            "relationship": "This is my wife"
          }
        ]
      },
      {
        "Id": "79125",
        "Description": "My mother who lives with us",
        "Profile": {
          "health": [
            "Suffers from chronic knee pain that makes it difficult for her to get around."
          ],
          "interests": ["Often paints watercolors with her daughter at home"],
          "notes": [
            "Feels engaged when painting watercolors with her daughter",
            "Will paint watercolors with her daughter on Wednesday evenings to contribute to local organizations."
          ]
        },
        "Connections": [
          {
            "id": "20760",
            "relationship": "This is my daughter"
          }
        ]
      },
      {
        "Id": "15044",
        "Description": "Emma, the 21-year-old daughter of the user who is studying nursing in college",
        "Profile": {
          "name": ["Emma"],
          "age": ["21 years old"],
          "job": ["Studying nursing in college"],
          "interests": ["Health and wellness"],
          "notes": [
            "Her school keeps her busy",
            "She would be thrilled about making yoga a regular family activity."
          ]
        },
        "Connections": [
          {
            "id": "20760",
            "relationship": "this is my mother"
          }
        ]
      },
      {
        "Id": "41703",
        "Description": "Jake, the 17-year-old son of the user",
        "Profile": {
          "name": ["Jake"],
          "age": ["17 years old"],
          "notes": [
            "Might benefit from doing yoga",
            "He might need a bit more convincing to join yoga.",
            "He is very close with his father and they often have their own plans on weekends.",
            "Has free evenings during the week",
            "Might attend a beginner's yoga class with his mother",
            "His mother hopes to spend quality time with him through yoga",
            "Will spend Saturdays with his mother packaging and delivering watercolors to local organizations."
          ],
          "interests": [
            "Passionate about baseball",
            "May enjoy activities that combine relaxation and volunteering."
          ]
        },
        "Connections": [
          {
            "id": "20760",
            "relationship": "This is my mother"
          }
        ]
      }
    ]
  }
]
